import React from "react";
import { StyledCommonWrapper } from "styles/CommonStyled";
import {
  Label,
  Terms,
  TermsOfUseInfoWrapper,
  TermsOfUsePageWrapper,
  TextAccent,
  Title,
  Wrapper,
} from "./TermsOfUsePage.styled";
import Subscribe from "components/Subscribe";

const TermsOfUsePage = () => {
  return (
    <StyledCommonWrapper>
      <TermsOfUsePageWrapper>
        <Label>Умови користування</Label>

        <TermsOfUseInfoWrapper>
          <TextAccent>
            Ласкаво просимо до онлайн-книгарні "Букарка"! Перш ніж ви
            скористаєтесь цим веб-сайтом, будь ласка, уважно ознайомтеся з
            даними Умовами користування. Ваш доступ та використання цього
            веб-сайту підтверджує вашу згоду з даними умовами. Якщо ви не
            погоджуєтеся з умовами, будь ласка, не використовуйте цей веб-сайт.
          </TextAccent>

          <Title>Умови користування</Title>

          <Terms>
            <li>
              <h2>Використання матеріалів</h2>
              <p>
                Весь контент нашого веб-сайту, включаючи тексти, зображення,
                відео та інші матеріали, захищений Законом про авторське право.
                Ви можете використовувати ці матеріали лише в особистих
                некомерційних цілях. Будь-яке інше використання, включаючи
                копіювання, розповсюдження чи модифікацію матеріалів, потребує
                попередньої письмової згоди від нас.
              </p>
            </li>

            <li>
              <h2>Реєстрація облікового запису</h2>
              <p>
                Деякі функції нашого веб-сайту можуть вимагати створення
                облікового запису. Ви зобов'язані надавати точну та повну
                інформацію під час реєстрації.
              </p>
            </li>

            <li>
              <h2>Заборона незаконної діяльності</h2>
              <p>
                Ви зобов'язані використовувати наш веб-сайт лише відповідно до
                закону та з урахуванням прав та інтересів інших користувачів.
                Заборонено будь-яке незаконне, загрозливе, спамове чи образливе
                використання нашого веб-сайту.
              </p>
            </li>

            <li>
              <h2>Зміни умов</h2>
              <p>
                Ми залишаємо за собою право в будь-який час змінювати ці умови
                використання, оновлюючи цю сторінку. Продовження використання
                нашого веб-сайту після внесення змін означатиме вашу згоду з
                оновленими умовами.
              </p>
            </li>
          </Terms>

          <TextAccent>
            Будь ласка, зважайте на ці Умови користування під час користування
            нашим веб-сайтом. Якщо у вас є будь-які питання щодо цих умов, будь
            ласка, зв'яжіться з нами за адресою електронної пошти
            bukarka.info@gmail.com або за номером телефону +380 96 123 45 67.
          </TextAccent>
        </TermsOfUseInfoWrapper>
        <Wrapper>
          <Subscribe />
        </Wrapper>
      </TermsOfUsePageWrapper>
    </StyledCommonWrapper>
  );
};

export default TermsOfUsePage;
