import { StyledCommonWrapper } from "styles/CommonStyled";
import {
  Label,
  Privacy,
  PrivacyInfoWrapper,
  PrivacyPolicyPageWrapper,
  TextAccent,
  Title,
  Wrapper,
} from "./PrivacyPolicyPage.styled";
import Subscribe from "components/Subscribe";

const PrivacyPolicyPage: React.FC = () => {
  return (
    <StyledCommonWrapper>
      <PrivacyPolicyPageWrapper>
        <Label>Політика конфіденційності</Label>
        <PrivacyInfoWrapper>
          <TextAccent>
            Вітаємо вас у магазині "Букарка"! Ми дбаємо про вашу
            конфіденційність і зобов'язуємося забезпечувати захист ваших
            особистих даних. Наша Політика конфіденційності пояснює, як ми
            збираємо, використовуємо, захищаємо та не розголошуємо ваші особисті
            дані в процесі використання даного веб-сайту та послуг.
          </TextAccent>

          <Title>Політика конфіденційності</Title>

          <Privacy>
            <li>
              <h2>Збір особистої інформації</h2>
              <p>
                Ми збираємо особисту інформацію, яку ви нам надаєте під час
                реєстрації на нашому сайті, замовлення товарів або спілкування з
                нашою службою підтримки. Ця інформація може включати ваше ім'я,
                адресу електронної пошти, контактні дані та іншу необхідну
                інформацію.
              </p>
            </li>

            <li>
              <h2>Використання інформації</h2>
              <p>
                Ми використовуємо вашу особисту інформацію для обробки
                замовлень, забезпечення високого рівня обслуговування клієнтів,
                покращення наших послуг та сповіщення вас про акції та
                пропозиції. Ми також можемо використовувати вашу інформацію для
                аналізу та вдосконалення роботи нашого сайту.
              </p>
            </li>

            <li>
              <h2>Захист інформації</h2>
              <p>
                Ми приділяємо велику увагу захисту вашої особистої інформації і
                вживаємо відповідних заходів безпеки для запобігання
                несанкціонованому доступу, зміні, розголошенню чи знищенню
                даних.
              </p>
            </li>

            <li>
              <h2>Розголошення інформації третім сторонам</h2>
              <p>
                Ми не розголошуємо вашу особисту інформацію третім сторонам без
                вашої згоди, за винятком випадків, коли це необхідно для
                виконання зобов'язань перед вами або відповідно до Законодавства
                України.
              </p>
            </li>

            <li>
              <h2>Контактна інформація</h2>
              <p>
                Якщо у вас є будь-які питання щодо нашої політики
                конфіденційності або обробки ваших особистих даних, будь ласка,
                зв'яжіться з нами за адресою електронної пошти
                bukarka.info@gmail.com або за номером телефону +380 96 123 45
                67.
              </p>
              <p>
                Ця політика конфіденційності вступає в силу з 1 січня 2024 року
                і може час від часу оновлюватися. Будь ласка, періодично
                переглядайте цю сторінку для отримання оновленої інформації про
                нашу політику конфіденційності.
              </p>
            </li>
          </Privacy>
        </PrivacyInfoWrapper>
        <Wrapper>
          <Subscribe />
        </Wrapper>
      </PrivacyPolicyPageWrapper>
    </StyledCommonWrapper>
  );
};

export default PrivacyPolicyPage;
